<h1 align="center" style="color: orange"> Pandas I </h1>

In [1]:
import numpy as np
import pandas as pd

In [25]:
# creating a series
my_lis = [2, 5, 1, 3, 9, 2]
my_series = pd.Series(my_lis)
my_series

0    2
1    5
2    1
3    3
4    9
5    2
dtype: int64

In [26]:
# explicit series
my_series_explicit = pd.Series(my_lis,
                               name='olympics_medals',
                               index=['India', 'Russia', 'US', 'China', 'Germany', 'Australia']
                               )
print(my_series_explicit)
my_series_explicit.index

India        2
Russia       5
US           1
China        3
Germany      9
Australia    2
Name: olympics_medals, dtype: int64

Index(['India', 'Russia', 'US', 'China', 'Germany', 'Australia'], dtype='object')

In [6]:
# NaN
not_a_number = np.nan

In [28]:
# mask
mask = my_series_explicit > my_series_explicit.median()
print(f'Mask:\n{mask}')

# filter
median_filter = my_series_explicit[mask]
median_filter

Mask:
India        False
Russia        True
US           False
China         True
Germany       True
Australia    False
Name: olympics_medals, dtype: bool

Russia     5
China      3
Germany    9
Name: olympics_medals, dtype: int64

In [30]:
# categorical data
shirt_size = pd.Series(['m', 'l', 'xs', 's', 'xl'], dtype='category')
shirt_size

0     m
1     l
2    xs
3     s
4    xl
dtype: category
Categories (5, object): ['l', 'm', 's', 'xl', 'xs']

In [36]:
# ordering categories and astype()
size_type = pd.api.types.CategoricalDtype(
    categories=['s', 'm', 'l', 'xl'], 
    ordered=True
)

ordered_shirt_size = shirt_size.astype(size_type)
print(ordered_shirt_size.cat.ordered)
ordered_shirt_size

True

0      m
1      l
2    NaN
3      s
4     xl
dtype: category
Categories (4, object): ['s' < 'm' < 'l' < 'xl']

In [11]:
# creating a dataFrame
car_speed = {'car': ['BMW', 'Tata', 'Ford'],
             'speed': [120, 90, 70]
             }

df = pd.DataFrame(car_speed, index=['German', 'India', 'US'])
df

         car  speed
German   BMW    120
India   Tata     90
US      Ford     70

In [12]:
# .iloc : access row by location index
df.iloc[0]

car      BMW
speed    120
Name: German, dtype: object

In [14]:
# .loc : access by position
df.loc['India']

car      Tata
speed      90
Name: India, dtype: object

In [20]:
# accessing elements
df['car']

German     BMW
India     Tata
US        Ford
Name: car, dtype: object

In [23]:
print(type(df['car']), type(df), sep='\n')

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [14]:
np_arr = np.random.default_rng().integers(low=1, high=100, size=120)
random_series = pd.Series(np_arr, name='random series')
random_series

0      38
1      42
2      43
3      63
4      19
       ..
115     2
116     5
117    76
118    99
119    77
Name: random series, Length: 120, dtype: int64

In [4]:
# loading a dataset
df = pd.read_csv('./Data/economy.csv')

In [7]:
df.head()

,Model,Displ,Cyl,Trans,Drive,Fuel,Cert Region,Stnd,Stnd Description,Underhood ID,Veh Class,Air Pollution Score,City MPG,Hwy MPG,Cmb MPG,Greenhouse Gas Score,SmartWay,Comb CO2
0,ACURA Integra,1.5,4.0,SCV-7,2WD,Gasoline,CA,L3SULEV30,California LEV-III SULEV30,RHNXV01.54EC,large car,7,30,37,33,6,No,269
1,ACURA Integra,1.5,4.0,SCV-7,2WD,Gasoline,FA,T3B30,Federal Tier 3 Bin 30,RHNXV01.54EC,large car,7,30,37,33,6,No,269
2,ACURA Integra,2.0,4.0,Man-6,2WD,Gasoline,CA,L3ULEV50,California LEV-III ULEV50,RHNXV02.0TDC,large car,6,21,28,24,5,No,371
3,ACURA Integra,2.0,4.0,Man-6,2WD,Gasoline,FA,T3B50,Federal Tier 3 Bin 50,RHNXV02.0TDC,large car,6,21,28,24,5,No,371
4,ACURA Integra A-Spec,1.5,4.0,Man-6,2WD,Gasoline,CA,L3ULEV50,California LEV-III ULEV50,RHNXV01.55DC,large car,6,26,36,30,6,No,293

In [10]:
df.columns

Index(['Model', 'Displ', 'Cyl', 'Trans', 'Drive', 'Fuel', 'Cert Region',
       'Stnd', 'Stnd Description', 'Underhood ID', 'Veh Class',
       'Air Pollution Score', 'City MPG', 'Hwy MPG', 'Cmb MPG',
       'Greenhouse Gas Score', 'SmartWay', 'Comb CO2'],
      dtype='object')

In [11]:
city_mpg, highway_mpg = df['City MPG'], df['Hwy MPG']

---

**Concatenation and Merging**

In [8]:
country_1_df = pd.DataFrame(
    {
        "Country": ["India", "Japan", "US"],
        "Currency": ["Indian Rupee ", "Japanese yen", "United States dollar"],
        "Temperature": [37, 26, 18],
        "humidity": [90.1, 34.2, 47.5]
    }
)

country_2_df = pd.DataFrame(
    {
        "Country": ["Korea", "Australia", "UK"],
        "Currency": ["Won", "Dollar", "UK Pound"],
        "Temperature": [17, 16, 18],
        "humidity": [40.1, 24.2, 27.5]
    }
)

country_1_df

  Country              Currency  Temperature  humidity
0   India         Indian Rupee            37      90.1
1   Japan          Japanese yen           26      34.2
2      US  United States dollar           18      47.5

In [9]:
country_combined_df = pd.concat([country_1_df, country_2_df])

print(country_combined_df)

country_combined_df_one_idx = pd.concat([country_1_df, country_2_df], ignore_index=True)

     Country              Currency  Temperature  humidity
0      India         Indian Rupee            37      90.1
1      Japan          Japanese yen           26      34.2
2         US  United States dollar           18      47.5
0      Korea                   Won           17      40.1
1  Australia                Dollar           16      24.2
2         UK              UK Pound           18      27.5

In the above cell, we concatenated the two dataframes in the row direction. We can also concatinate the dataframes in the column direction. For that we need to pass the `axis=1` as an argument to the `concat()` function.

In [10]:
side_by_side_df = pd.concat([country_1_df, country_2_df], ignore_index=True, axis=1)
side_by_side_df

       0                     1   2     3          4         5   6     7
0  India         Indian Rupee   37  90.1      Korea       Won  17  40.1
1  Japan          Japanese yen  26  34.2  Australia    Dollar  16  24.2
2     US  United States dollar  18  47.5         UK  UK Pound  18  27.5

In [11]:
country_3_df = pd.DataFrame(
    {
        "Country": ["India", "Japan", "US"],
        "Air Quality": [6, 4, 5]
    }
) 

merged_df = pd.merge( country_2_df, country_3_df, on='Country', how='outer')
merged_df

     Country  Currency  Temperature  humidity  Air Quality
0      Korea       Won         17.0      40.1          NaN
1  Australia    Dollar         16.0      24.2          NaN
2         UK  UK Pound         18.0      27.5          NaN
3      India       NaN          NaN       NaN          6.0
4      Japan       NaN          NaN       NaN          4.0
5         US       NaN          NaN       NaN          5.0

In the above df, we can see that those values which are not present in both the input data frames were not dropped as it happened in inner join (merge without specifying outer).

**loc and iloc**

`loc` and `iloc` are the two functions which are used to access the data from the dataframe. `loc` is used to access the data using the labels of the rows and columns. `iloc` is used to access the data using the index of the rows and columns.

In [22]:
print(f'loc[2]  = {merged_df.loc[2]}\n') # Using indexing for accessing data
print(f"iloc[2] = {merged_df.iloc[2]}")  # Using the row number

loc[2]  = Country              UK
Currency       UK Pound
Temperature        18.0
humidity           27.5
Air Quality         NaN
Name: 2, dtype: object

iloc[2] = Country              UK
Currency       UK Pound
Temperature        18.0
humidity           27.5
Air Quality         NaN
Name: 2, dtype: object

Now let us come back to our main dataset and see some more functions of pandas.

In [24]:
print(df.describe())

# including summaries of object datatypes also
print(df.describe(include='object'))

       culmen_length_mm  culmen_depth_mm  flipper_length_mm  body_mass_g
count        342.000000       342.000000         342.000000   342.000000
mean          43.921930        17.151170         200.915205  4201.754386
std            5.459584         1.974793          14.061714   801.954536
min           32.100000        13.100000         172.000000  2700.000000
25%           39.225000        15.600000         190.000000  3550.000000
50%           44.450000        17.300000         197.000000  4050.000000
75%           48.500000        18.700000         213.000000  4750.000000
max           59.600000        21.500000         231.000000  6300.000000
       species  island   sex
count      344     344   334
unique       3       3     3
top     Adelie  Biscoe  MALE
freq       152     168   168

In [6]:
species_series = df['species']
species_series

0      Adelie
1      Adelie
2      Adelie
3      Adelie
4      Adelie
        ...
339    Gentoo
340    Gentoo
341    Gentoo
342    Gentoo
343    Gentoo
Name: species, Length: 344, dtype: object

In [9]:
# changing the index (2, end, 2)
species_series.index = np.arange(2, (df.shape[0]+1)*2, 2)
species_series

2      Adelie
4      Adelie
6      Adelie
8      Adelie
10     Adelie
        ...
680    Gentoo
682    Gentoo
684    Gentoo
686    Gentoo
688    Gentoo
Name: species, Length: 344, dtype: object

In [10]:
species_series.iloc[[1, 10, 100]]

4      Adelie
22     Adelie
202    Adelie
Name: species, dtype: object

In [12]:
# species_series.loc[[1, 10, 100]]  # error
species_series.loc[[2, 10, 100]]

2      Adelie
10     Adelie
100    Adelie
Name: species, dtype: object

In [14]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
339    False
340    False
341    False
342    False
343    False
Length: 344, dtype: bool

In [15]:
# finding duplicates
df.loc[df.duplicated()]

Empty DataFrame
Columns: [species, island, culmen_length_mm, culmen_depth_mm, flipper_length_mm, body_mass_g, sex]
Index: []

In [17]:
df.iloc[0:5, 0:3 ]

  species     island  culmen_length_mm
0  Adelie  Torgersen              39.1
1  Adelie  Torgersen              39.5
2  Adelie  Torgersen              40.3
3  Adelie  Torgersen               NaN
4  Adelie  Torgersen              36.7

In [20]:
df.loc[0:5, ['species', 'body_mass_g', 'island']]

  species  body_mass_g     island
0  Adelie       3750.0  Torgersen
1  Adelie       3800.0  Torgersen
2  Adelie       3250.0  Torgersen
3  Adelie          NaN  Torgersen
4  Adelie       3450.0  Torgersen
5  Adelie       3650.0  Torgersen

In [22]:
df.sort_values(['culmen_length_mm'], ascending=False)

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
253,Gentoo,Biscoe,59.6,17.0,230.0,6050.0,MALE
169,Chinstrap,Dream,58.0,17.8,181.0,3700.0,FEMALE
321,Gentoo,Biscoe,55.9,17.0,228.0,5600.0,MALE
215,Chinstrap,Dream,55.8,19.8,207.0,4000.0,MALE
335,Gentoo,Biscoe,55.1,16.0,230.0,5850.0,MALE
...,...,...,...,...,...,...,...
70,Adelie,Torgersen,33.5,19.0,190.0,3600.0,FEMALE
98,Adelie,Dream,33.1,16.1,178.0,2900.0,FEMALE
142,Adelie,Dream,32.1,15.5,188.0,3050.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN

In [23]:
df.sort_values(['culmen_length_mm', 'body_mass_g'], ascending=[True, False])

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
142,Adelie,Dream,32.1,15.5,188.0,3050.0,FEMALE
98,Adelie,Dream,33.1,16.1,178.0,2900.0,FEMALE
70,Adelie,Torgersen,33.5,19.0,190.0,3600.0,FEMALE
92,Adelie,Dream,34.0,17.1,185.0,3400.0,FEMALE
8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN
...,...,...,...,...,...,...,...
321,Gentoo,Biscoe,55.9,17.0,228.0,5600.0,MALE
169,Chinstrap,Dream,58.0,17.8,181.0,3700.0,FEMALE
253,Gentoo,Biscoe,59.6,17.0,230.0,6050.0,MALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN

In [ ]:
df.to_csv('data_without_index.csv', index=False)